Current-Electric-Vehicles/esp32-safemode/firmware/sdkconfig.defaults
# Safemode Default Configuration — optimized for minimum binary size.
# Safemode is a WiFi AP + HTTP server. No TLS, no IPv6, no enterprise auth.

# Target
CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# Tolerate partition tables without MD5 (safemode runs on other devices)
CONFIG_PARTITION_TABLE_MD5=n

# Compiler — optimize for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set

# Logging — warn only in release, info in dev
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Bootloader — reduce log level to save flash
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Panic handler
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# HTTP server
CONFIG_HTTPD_MAX_URI_HANDLERS=16
# CONFIG_HTTPD_WS_SUPPORT is not set

# LWIP — minimal network stack
CONFIG_LWIP_MAX_SOCKETS=8
# CONFIG_LWIP_IPV6 is not set
# CONFIG_LWIP_SNTP is not set
# CONFIG_LWIP_NETIF_LOOPBACK is not set
# CONFIG_LWIP_AUTOIP is not set

# WiFi — AP mode with WPA2-PSK only, no extras
# CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT is not set
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# mbedTLS — keep TLS APIs (esp-tls won't compile without them) but
# trim features we don't use. WPA2-PSK only needs AES/SHA.
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE is not set
# CONFIG_MBEDTLS_PKCS7_C is not set
# CONFIG_MBEDTLS_SELF_TEST is not set
# CONFIG_MBEDTLS_ERROR_STRINGS is not set
# CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED is not set
# CONFIG_MBEDTLS_KEY_EXCHANGE_RSA is not set
# CONFIG_MBEDTLS_SSL_RENEGOTIATION is not set
# CONFIG_MBEDTLS_SSL_ALPN is not set
# CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS is not set
# CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS is not set

# Disable unused subsystems
# CONFIG_VFS_SUPPORT_SELECT is not set
# CONFIG_ESP_ERR_TO_NAME_LOOKUP is not set

# Use newlib nano for smaller printf
CONFIG_NEWLIB_NANO_FORMAT=y

# Disable additional unused mbedTLS features
# CONFIG_MBEDTLS_HAVE_TIME is not set
# CONFIG_MBEDTLS_HAVE_TIME_DATE is not set
# CONFIG_MBEDTLS_FS_IO is not set
# CONFIG_MBEDTLS_HKDF_C is not set
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set

# Disable file system support (we don't use any FS)
# CONFIG_VFS_SUPPORT_DIR is not set
# CONFIG_VFS_SUPPORT_TERMIOS is not set

# Disable LWIP features we don't need
# CONFIG_LWIP_DHCP_DOES_ARP_CHECK is not set
# CONFIG_LWIP_DHCP_RESTORE_LAST_IP is not set
# CONFIG_LWIP_TCP_KEEPALIVE is not set

# Smaller WiFi RX buffers (we don't push much data)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8

# Disable advanced WiFi features
# CONFIG_ESP_WIFI_RX_BA_WIN is not set
# CONFIG_ESP_WIFI_FTM_ENABLE is not set
# CONFIG_ESP_WIFI_GMAC_SUPPORT is not set
# CONFIG_ESP_WIFI_11KV_SUPPORT is not set
# CONFIG_ESP_WIFI_MBO_SUPPORT is not set
# CONFIG_ESP_WIFI_DPP_SUPPORT is not set
# CONFIG_ESP_WIFI_11R_SUPPORT is not set
# CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR is not set
# CONFIG_ESP_WIFI_WAPI_PSK is not set
# CONFIG_ESP_WIFI_NAN_ENABLE is not set
# CONFIG_ESP_WIFI_ENABLE_ROAMING_APP is not set

# Disable enterprise auth (we use WPA2-PSK)
# CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT is not set

# Bootloader optimization for size
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
